{
  "landingPageTitle": "Elegant and Accessible Landing Page",
  "landingPageDescription": "A visually stunning and accessible landing page, built with [your preferred frontend framework, e.g., React, Vue or Angular]. This project demonstrates proficiency in creating user-friendly, visually appealing, and accessible web experiences.",
  "spaTitle": "Dynamic and Immersive SPA with Framer Motion",
  "spaDescription": "An engaging single-page application (SPA) that leverages the power of Framer Motion to deliver smooth, interactive, and visually impressive user experiences. This project showcases advanced animation techniques and a deep understanding of modern web development practices.",
  "accessibilityTitle": "Web Development Prioritizing Accessibility",
  "accessibilityDescription": "A collection of web projects that prioritize accessibility and inclusion. These projects adhere to WCAG guidelines and utilize assistive technologies to ensure a seamless experience for all users, regardless of their abilities.",
  "trelloCloneTitle": "Animated Trello Clone",
  "trelloCloneDescription": "A fully functional Trello clone with a focus on engaging animations and user experience. This project demonstrates proficiency in state management, component-based architecture, and building interactive web applications.",
  "nestedArticleTitle": "Diving into TypeScript's NestedKey Type",
  "nestedArticleSummary": "This TypeScript type alias, `NestedKeysType`, is a powerful tool for extracting keys from nested properties of object types. It recursively traverses object structures, identifying and concatenating property keys at each level. This technique is essential for dynamic property access, safe object type manipulation, and generating type-safe API endpoints.",
  "tecnoJrTab": "2018–2022",
  "tecnoJr": "TecnoJr",
  "tecnoJrDescription": "Over 4 years at TecnoJr, I worked as a <strong>Full Stack Developer</strong> on multiple web and mobile projects, taking part in the full development lifecycle and leading internal training initiatives.<br><br><strong>Key responsibilities and achievements:</strong><ul><li>Developed web platforms and landing pages using <strong>PHP, Node.js, WordPress, React Native, HTML, CSS, and JavaScript</strong>.</li><li>Served as <strong>Training Manager</strong>, designing and delivering web development courses for trainees and new members.</li><li>Led cross-functional projects, ensuring on-time and high-quality deliveries.</li><li>Participated in client meetings, requirements gathering, and technical documentation.</li><li>Applied agile methodologies (<strong>Scrum</strong>) for sprint planning and project tracking.</li></ul><strong>",
  "softTrendsTab": "2021–2022",
  "softTrends": "Softrends",
  "softTrendsDescription": "At Softrends, I worked as a <strong>Full Stack Developer</strong> at a startup that built a cryptocurrency platform where each token was backed by real cocoa production, supporting the Brazilian market. I contributed to both front-end and back-end development, focusing on usability, security, and performance.<br><br><strong>Main responsibilities and achievements:</strong><ul><li>Developed and maintained core features of the crypto platform, including <strong>wallet visualization, crypto purchasing, and PIX integration</strong> for deposits.</li><li>Implemented <strong>token-based authentication</strong>, user registration, and secure transaction flows.</li><li>Applied <strong>Clean Architecture</strong> and <strong>Clean Code</strong> principles to ensure scalability and maintainability.</li><li>Set up <strong>CI/CD pipelines</strong> and automated testing using GitHub Actions, improving delivery reliability.</li><li>Collaborated with a multidisciplinary team using <strong>Scrum</strong> to deliver continuous improvements and new features.</li></ul><strong>",
  "vexpensesTab": "2022",
  "vexpenses": "Vexpenses",
  "vexpensesDescription": "Currently working as a <strong>Full-Stack Developer</strong> at Vexpenses, focusing on modernizing and optimizing the company’s SaaS ecosystem through performance improvements and scalable architecture.<br><br><strong>Key responsibilities and achievements:</strong><ul><li>Refactored legacy monolithic screens into <strong>React</strong>, developing integration APIs for modular communication.</li><li>Improved API performance by refactoring and optimizing slow queries and database indexes.</li><li>Redesigned the form layer using <strong>React Hook Form + Context API</strong>, improving code modularity and reusability.</li><li>Optimized API consumption with <strong>React Query</strong>, reducing redundant requests and implementing caching layers.</li><li>Automated <strong>GA4</strong> event tracking through abstraction scripts, reducing manual listener setup.</li><li>Implemented <strong>end-to-end testing (E2E)</strong> from scratch, improving system reliability.</li><li>Contributed to architecture discussions, code standardization, and front-end scalability.</li></ul><strong>",
  "aboutMe": "About me",
  "aboutMeDescription": "I am a Bachelor in Computer Science with a strong passion for technology and programming. Since my first experience with coding at university, I realized that programming would become more than just a career — it’s something I use daily to learn, create, and solve problems. I enjoy applying programming to automate tasks and find practical solutions whenever possible. Beyond development, I’m also a fan of Linux, gaming, reading (books and comics), animations, and music — hobbies that keep my creativity and curiosity alive both inside and outside of work.",
  "about": "About",
  "carrear": "Career",
  "projects": "Projects",
  "implementations": "Implementations",
  "frontendDev": "Frontend Developer,",
  "fullstackDev": "Fullstack Developer,",
  "transforming": "transforming",
  "designsInto": "ideas into exceptional digital experiences.",
  "implementingRobustSolutions": "Implementing scalable and robust web solutions, ready to meet business growth."
}
