{
  "landingPageTitle": "Elegant and Accessible Landing Page",
  "landingPageDescription": "A visually stunning and accessible landing page, built with [your preferred frontend framework, e.g., React, Vue or Angular]. This project demonstrates proficiency in creating user-friendly, visually appealing, and accessible web experiences.",
  "spaTitle": "Dynamic and Immersive SPA with Framer Motion",
  "spaDescription": "An engaging single-page application (SPA) that leverages the power of Framer Motion to deliver smooth, interactive, and visually impressive user experiences. This project showcases advanced animation techniques and a deep understanding of modern web development practices.",
  "accessibilityTitle": "Web Development Prioritizing Accessibility",
  "accessibilityDescription": "A collection of web projects that prioritize accessibility and inclusion. These projects adhere to WCAG guidelines and utilize assistive technologies to ensure a seamless experience for all users, regardless of their abilities.",
  "trelloCloneTitle": "Animated Trello Clone",
  "trelloCloneDescription": "A fully functional Trello clone with a focus on engaging animations and user experience. This project demonstrates proficiency in state management, component-based architecture, and building interactive web applications.",
  "nestedArticleTitle": "Diving into TypeScript's NestedKey Type",
  "nestedArticleSummary": "This TypeScript type alias, `NestedKeysType`, is a powerful tool for extracting keys from nested properties of object types. It recursively traverses object structures, identifying and concatenating property keys at each level. This technique is essential for dynamic property access, safe object type manipulation, and generating type-safe API endpoints.",
  "tecnoJrTab": "2018-2022",
  "tecnoJr": "TecnoJr",
  "tecnoJrDescription": "During my 4 years at TecnoJr, working as a Full Stack Developer, I developed and deployed various web and mobile solutions. I used technologies like React Native, HTML, CSS, JavaScript, PHP, and WordPress to create intuitive interfaces and robust systems. My experience in agile methodologies, such as Scrum, allowed me to collaborate effectively in multidisciplinary teams and deliver projects on time and with high quality.",
  "softTrendsTab": "2021-2022",
  "softTrends": "Softrends",
  "softTrendsDescription": "During my time at Softrends, I worked as a Full Stack Developer, being responsible for the entire development lifecycle of projects. I used technologies like React JS, React Native, Node.js, HTML, CSS, and JavaScript to create high-performance and user-friendly web and mobile applications. My experience in Scrum enabled me to work in a team, delivering projects with quality and within the established deadlines.",
  "vexpensesTab": "2022-XXXX",
  "vexpenses": "Vexpenses",
  "vexpensesDescription": "Currently, I work as a Front-end Developer at Vexpenses, where I am responsible for transforming designs into interactive and efficient web interfaces. I use React JS and Typescript to build reusable and scalable components. My experience in agile methodologies and tools like Jira allows me to collaborate effectively in remote teams and deliver projects with quality and on time.",
  "aboutMe": "About me",
  "aboutMeDescription": "Fullstack Developer with solid experience in React JS, Typescript, PHP, Laravel, and Node.js. In recent years, I have worked on the development and maintenance of a SaaS platform built mainly with Laravel, React, and Node, focusing on implementing new features and improving the user experience. <br/> During this time, I dealt with complex business rules embedded in the code and communication between multiple internal services. I contributed to performance optimization in legacy systems through research and improvements, as well as refactoring outdated interfaces into modern and scalable solutions using React, Typescript, and Node.",
  "about": "About",
  "carrear": "Career",
  "projects": "Projects",
  "implementations": "Implementations",
  "frontendDev": "Frontend Developer,",
  "fullstackDev": "Fullstack Developer,",
  "transforming": "transforming",
  "designsInto": "ideas into exceptional digital experiences.",
  "implementingRobustSolutions": "Implementing scalable and robust web solutions, ready to meet business growth."
}
