{
  "landingPageTitle": "Página de Destino Elegante e Acessível",
  "landingPageDescription": "Uma página de destino visualmente deslumbrante e acessível, construída com [seu framework frontend preferido, e.g., React, Vue ou Angular]. Este projeto demonstra domínio na criação de experiências web amigáveis, visualmente atraentes e acessíveis.",
  "spaTitle": "SPA Dinâmica e Imersiva com Framer Motion",
  "spaDescription": "Um aplicativo de página única (SPA) cativante que utiliza o poder do Framer Motion para oferecer experiências de usuário suaves, interativas e visualmente impressionantes. Este projeto demonstra técnicas avançadas de animação e um profundo conhecimento das práticas modernas de desenvolvimento web.",
  "accessibilityTitle": "Desenvolvimento Web Priorizando a Acessibilidade",
  "accessibilityDescription": "Uma coleção de projetos web que priorizam a acessibilidade e a inclusão. Esses projetos aderem às diretrizes WCAG e utilizam tecnologias assistivas para garantir uma experiência perfeita para todos os usuários, independentemente de suas habilidades.",
  "trelloCloneTitle": "Clone do Trello Animado",
  "trelloCloneDescription": "Um clone do Trello totalmente funcional com foco em animações envolventes e experiência do usuário. Este projeto demonstra proficiência em gerenciamento de estado, arquitetura baseada em componentes e criação de aplicativos web interativos.",
  "nestedArticleTitle": "Imersão no Tipo NestedKey do TypeScript",
  "nestedArticleSummary": "Este alias de tipo do TypeScript, `NestedKeysType`, é uma ferramenta poderosa para extrair chaves de propriedades aninhadas de tipos de objeto. Ele percorre recursivamente estruturas de objetos, identificando e concatenando chaves de propriedades em cada nível. Essa técnica é essencial para acesso dinâmico a propriedades, manipulação segura de tipos de objeto e geração de endpoints de API seguros de tipo.",
  "tecnoJrTab": "2018–2022",
  "tecnoJr": "TecnoJr",
  "tecnoJrDescription": "Durante 4 anos na TecnoJr, atuei como <strong>Desenvolvedor Full Stack</strong> em diversos projetos web e mobile, participando de todo o ciclo de desenvolvimento e liderando iniciativas de capacitação interna.<br><br><strong>Principais responsabilidades e conquistas:</strong><ul><li>Desenvolvi plataformas web e landing pages utilizando <strong>PHP, Node.js, WordPress, React Native, HTML, CSS e JavaScript</strong>.</li><li>Atuei como <strong>Gerente de Capacitação</strong>, planejando e ministrando treinamentos técnicos para trainees e novos membros.</li><li>Liderei projetos multidisciplinares, garantindo entregas dentro do prazo e com qualidade.</li><li>Participei de reuniões com clientes, levantamento de requisitos e documentação técnica.</li><li>Adotei metodologias ágeis (<strong>Scrum</strong>) para organizar sprints e acompanhar o progresso das equipes.</li></ul><strong>",
  "softTrendsTab": "2021–2022",
  "softTrends": "Softrends",
  "softTrendsDescription": "Na Softrends, atuei como <strong>Desenvolvedor Full Stack</strong> em uma startup que desenvolveu uma plataforma de criptomoeda onde cada token era lastreado na produção real de cacau, apoiando o mercado brasileiro. Contribuí tanto no front-end quanto no back-end, com foco em usabilidade, segurança e performance.<br><br><strong>Principais responsabilidades e conquistas:</strong><ul><li>Desenvolvi e mantive funcionalidades centrais da plataforma de cripto, incluindo <strong>visualização de carteira, compra de cripto e integração com PIX</strong> para depósitos.</li><li>Implementei <strong>autenticação baseada em tokens</strong>, cadastro de usuários e fluxos de transações seguras.</li><li>Adotei princípios de <strong>Clean Architecture</strong> e <strong>Clean Code</strong> para garantir escalabilidade e manutenção do sistema.</li><li>Configurei <strong>pipelines de CI/CD</strong> e testes automatizados com GitHub Actions, aumentando a confiabilidade das entregas.</li><li>Colaborei com uma equipe multidisciplinar utilizando <strong>Scrum</strong> para entregar melhorias contínuas e novas funcionalidades.</li></ul><strong>",
  "vexpensesTab": "2022",
  "vexpenses": "Vexpenses",
  "vexpensesDescription": "Atualmente, atuo como <strong>Desenvolvedor Full-Stack</strong> na Vexpenses, colaborando na modernização e evolução do ecossistema SaaS da empresa, com foco em performance, escalabilidade e automação.<br><br><strong>Principais responsabilidades e conquistas:</strong><ul><li>Refatorei telas do monólito legado para <strong>React</strong>, criando APIs de integração entre sistemas.</li><li>Otimizei a performance de APIs, identificando e corrigindo gargalos em consultas e índices de banco de dados.</li><li>Implementei uma nova camada de formulários com <strong>React Hook Form + Context API</strong>, tornando o código mais reutilizável e modular.</li><li>Melhorei o consumo de APIs com <strong>React Query</strong>, reduzindo requisições redundantes e criando camadas de cache para melhor experiência do usuário.</li><li>Automatizei eventos <strong>GA4</strong> com scripts dinâmicos, abstraindo listeners e reduzindo manutenção manual.</li><li>Implementei <strong>testes E2E</strong> do zero, aumentando a confiança e estabilidade nas entregas.</li><li>Atuei na refatoração, arquitetura front-end e padronização de código.</li></ul><strong>",
  "aboutMe": "Sobre mim",
  "aboutMeDescription": "Sou bacharel em Ciência da Computação e tenho grande paixão por tecnologia e programação. Desde o primeiro contato com código na faculdade, descobri que programar seria mais do que apenas uma profissão — tornou-se parte do meu dia a dia. Gosto de usar programação para resolver problemas e automatizar tarefas sempre que possível, explorando novas formas de aplicar o que aprendo. Além do mundo do desenvolvimento, também sou entusiasta de Linux, games, leitura (livros e quadrinhos), animações e música — interesses que alimentam minha curiosidade e criatividade dentro e fora do código.",
  "about": "Sobre",
  "carrear": "Carreira",
  "projects": "Projetos",
  "implementations": "Implementações",
  "frontendDev": "Desenvolvedor Frontend,",
  "fullstackDev": "Desenvolvedor FullStack,",
  "transforming": "transformando",
  "designsInto": "ideias em experiências digitais excepcionais.",
  "implementingRobustSolutions": "Implementando soluções escaláveis e robustas, prontas para atender ao crescimento do negócio."
}
