{
  "landingPageTitle": "Página de Destino Elegante e Acessível",
  "landingPageDescription": "Uma página de destino visualmente deslumbrante e acessível, construída com [seu framework frontend preferido, e.g., React, Vue ou Angular]. Este projeto demonstra domínio na criação de experiências web amigáveis, visualmente atraentes e acessíveis.",
  "spaTitle": "SPA Dinâmica e Imersiva com Framer Motion",
  "spaDescription": "Um aplicativo de página única (SPA) cativante que utiliza o poder do Framer Motion para oferecer experiências de usuário suaves, interativas e visualmente impressionantes. Este projeto demonstra técnicas avançadas de animação e um profundo conhecimento das práticas modernas de desenvolvimento web.",
  "accessibilityTitle": "Desenvolvimento Web Priorizando a Acessibilidade",
  "accessibilityDescription": "Uma coleção de projetos web que priorizam a acessibilidade e a inclusão. Esses projetos aderem às diretrizes WCAG e utilizam tecnologias assistivas para garantir uma experiência perfeita para todos os usuários, independentemente de suas habilidades.",
  "trelloCloneTitle": "Clone do Trello Animado",
  "trelloCloneDescription": "Um clone do Trello totalmente funcional com foco em animações envolventes e experiência do usuário. Este projeto demonstra proficiência em gerenciamento de estado, arquitetura baseada em componentes e criação de aplicativos web interativos.",
  "nestedArticleTitle": "Imersão no Tipo NestedKey do TypeScript",
  "nestedArticleSummary": "Este alias de tipo do TypeScript, `NestedKeysType`, é uma ferramenta poderosa para extrair chaves de propriedades aninhadas de tipos de objeto. Ele percorre recursivamente estruturas de objetos, identificando e concatenando chaves de propriedades em cada nível. Essa técnica é essencial para acesso dinâmico a propriedades, manipulação segura de tipos de objeto e geração de endpoints de API seguros de tipo.",
  "tecnoJrTab": "2018-2022",
  "tecnoJr": "TecnoJr",
  "tecnoJrDescription": "Durante os 4 anos em que trabalhei na TecnoJr, atuando como Desenvolvedor Full Stack, desenvolvi e implantei diversas soluções web e mobile. Utilizei tecnologias como React Native, HTML, CSS, JavaScript, PHP e WordPress para criar interfaces intuitivas e sistemas robustos. Minha experiência em metodologias ágeis, como Scrum, me permitiu colaborar efetivamente em equipes multidisciplinares e entregar projetos dentro do prazo e com alta qualidade.",
  "softTrendsTab": "2021-2022",
  "softTrends": "Softrends",
  "softTrendsDescription": "Durante minha passagem pela Softrends, atuei como Desenvolvedor Full Stack, sendo responsável por todo o ciclo de vida de desenvolvimento de projetos. Utilizei tecnologias como React JS, React Native, Node.js, HTML, CSS e JavaScript para criar aplicações web e mobile com alta performance e usabilidade. A experiência em Scrum me permitiu trabalhar em equipe, entregando projetos com qualidade e dentro dos prazos estabelecidos.",
  "vexpensesTab": "2022-XXXX",
  "vexpenses": "Vexpenses",
  "vexpensesDescription": "Atualmente, trabalho como Desenvolvedor Front-end na Vexpenses, onde sou responsável por transformar designs em interfaces web interativas e eficientes. Utilizo React JS e Typescript para construir componentes reutilizáveis e escaláveis. Minha experiência em metodologias ágeis e ferramentas como Jira me permite colaborar de forma eficaz em equipes remotas e entregar projetos com qualidade e dentro do prazo.",
  "aboutMe": "Sobre mim",
  "aboutMeDescription": "Nos últimos anos, atuei no desenvolvimento e manutenção de uma plataforma SaaS construída principalmente com Laravel, React e Node, com foco em implementar novas funcionalidades e melhorar a experiência do usuário. Durante esse período, trabalhei com regras de negócio complexas acopladas ao código e com a comunicação entre múltiplos serviços internos. Contribuí para a melhoria de performance de sistemas legados por meio de estudos e otimizações, além de refatorar telas antigas para soluções modernas e escaláveis utilizando React, Typescript e Node.",
  "about": "Sobre",
  "carrear": "Careira",
  "projects": "Projetos",
  "implementations": "Implementações",
  "frontendDev": "Desenvolvedor Frontend,",
  "fullstackDev": "Desenvolvedor FullStack,",
  "transforming": "transformando",
  "designsInto": "ideias em experiências digitais excepcionais.",
  "implementingRobustSolutions": "Implementando soluções escaláveis e robustas, prontas para atender ao crescimento do negócio."
}
